# -*- mode: ruby-ts;-*-
tap "homebrew/bundle"

# For some reason, php installed via nixpkgs is horrendously slow on startup
# (~5s vs 35ms), which makes editor tooling that relies on it mostly unusable.
brew "php@8.2"
brew "php-cs-fixer"
brew "mas" if OS.mac?
brew "terminal-notifier" if OS.mac?

cask "1password"
cask "alfred"
cask "arc"
cask "chromium", args: {"no-quarantine": true}
cask "cljstyle"
cask "daisydisk"
cask "dash"
cask "hammerspoon"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "monitorcontrol"
cask "obsidian"
cask "plexamp"
cask "rectangle"
cask "slack"
cask "spotify"
cask "zed"

mas "Things", id: 904280696
