# -*- mode: ruby-ts;-*-

tap "homebrew/bundle"

brew "mas" if OS.mac?
brew "terminal-notifier" if OS.mac?

cask "1password"
cask "alfred"
cask "chromium"
cask "cljstyle"
cask "daisydisk"
cask "dash"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "monitorcontrol"
cask "plexamp"
cask "rectangle"
cask "slack"
cask "spotify"
cask "syncthing"

mas "Things", id: 904280696
