# -*- mode: ruby-ts;-*-
tap "babashka/brew"
tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "terminal-notifier" if OS.mac?

cask "1password" if OS.mac?
cask "alacritty" if OS.mac?
cask "alfred" if OS.mac?
cask "daisydisk" if OS.mac?
cask "dash" if OS.mac?
cask "font-hack-nerd-font" if OS.mac?
cask "istat-menus" if OS.mac?
cask "jetbrains-toolbox" if OS.mac?
cask "monitorcontrol" if OS.mac?
cask "plexamp" if OS.mac?
cask "rectangle" if OS.mac?
cask "slack" if OS.mac?
cask "spotify" if OS.mac?
cask "syncthing" if OS.mac?

mas "Things", id: 904280696
